{***************************************************************************
サイトマップのtplファイル

mp	20141112	テンプレートまとめ		


***************************************************************************}

{*ヘッドタグの中身を追加*}
{capture name="header"}
<link rel="stylesheet" href="../css/sitemap.css" type="text/css">
{/capture}

{include file="../tpl/header.tpl"}

    
<main id="kiji">   
    
    
<!------------------------------------------------------------------------------------------------------
↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑
ここまで共通部分（スタイルシート除く）
↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑
---------------------------------------------------------------------------------------------------------->
{*	取得データ
	大カテゴリのやつ

	$cate_no			カテゴリナンバー
	$cate_name			カテゴリ名
	$cate_count			カテゴリのカウント
	
	小カテゴリのやつ
	$cate_no_s			カテゴリナンバー(小カテゴリの)
	$cate_s_no			小カテゴリナンバー
    $cate_s_name		小カテゴリ名
    $cate_s_count		小カテゴリのカウント
*}



<div class=art_wrap>
<h1>記事カテゴリ一覧</h1>
{*カテゴリ大をすべて並べる*}
{for $vara=0 to count($cate_no)-1}
 	<p><a href="./category.html?cate_no={$cate_no[$vara]}">{$cate_name[$vara]}({$cate_count[$vara]})</a></p>
	<ol>
{*小カテのカテゴリ大のナンバーを確認して今のカテゴリナンバーと同じなら並べる*}
	{for $varb=0 to count($cate_no_s)-1}
    	{if empty($cate_s_name)}
        	{continue}
        {elseif $cate_no[$vara]==$cate_no_s[$varb] && $cate_s_name!=NULL}
				<li><a href="./category.html?cate_s_no={$cate_s_no[$varb]}">{$cate_s_name[$varb]}({$cate_s_count[$varb]})</a></li>
        
        {/if}
    {/for}
    </ol>
{/for}

</div>
<!------------------------------------------------------------------------------------------------------
↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓
ここから共通部分
↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓↓
---------------------------------------------------------------------------------------------------------->

</main>

<!--プロフィール-->
{include file="../tpl/fooder.tpl"}
